var 图片集 = 数组("饿鬼"="rc:饿鬼.bmp","二口女"="rc:二口女.bmp","鬼使黑"="rc:鬼使黑.bmp","海坊主"="rc:海坊主.bmp","金币妖怪"="rc:金币妖怪.bmp","跳跳哥哥"="rc:跳跳哥哥.bmp","骨女"="rc:骨女")

功能 寻找关闭状态的卷轴()
    log("寻找关闭状态的卷轴")
    lw.FindMultiColor(904,466,919,478,"F8BDBD","0|6|D65959",0.9, 1)
    return 判断找图结果()
结束


功能 寻找打开状态的卷轴()
    log("寻找打开状态的卷轴")
    lw.FindMultiColor(946,481,958,490,"AE9696","7|-2|1B347D",0.9, 1)
    return 判断找图结果()
结束

功能 寻找卷轴的组队图标()
    log("寻找卷轴的组队图标")
    lw.FindMultiColor(184,498,194,506,"D0C6B6","-2|4|76615A",0.9, 1)
    return 判断找图结果()
结束

功能 寻找妖气封印的图标()
    log("寻找妖气封印的图标")
    lw.FindStrFast(131,424,169,460,"妖","DFBE67-555555",0.8)
    return 判断找图结果()
结束

功能 寻找妖气封印的妖怪(妖气封印的妖怪)
    变量 索引 = 数组键查找(图片集,妖气封印的妖怪)
    变量 值,key
    数组获取元素(图片集,索引,值,key)
    lw.findpic(399,128,466,436, 获取资源路径(值))
    return 判断找图结果()
结束

功能 寻找图标全部()
    log("寻找图标全部")
    lw.FindStrFast(163,98,209,124,"全","DFBE67-555555",0.8)
    return 判断找图结果()
结束


功能 寻找准备图标()
    log("寻找准备图标")
    lw.FindStrFast(831,379,915,439,"准备","EFD684-333333|CFAB53-555555",0.8)
    return 判断找图结果()
结束

功能 寻找胜利图标()
    log("寻找胜利图标")
    lw.FindStrFast(640,79,775,216,"利","EFD684-333333|CFAB53-555555",0.8)
    return 判断找图结果()
结束

功能 寻找失败图标()
    log("寻找失败图标")
    lw.findpic(613,104,662,148, 获取资源路径("rc:失败.bmp"))
    return 判断找图结果()
结束

功能 寻找发光达摩()
    log("寻找发光达摩")
    lw.findpic(431,223,453,254, 获取资源路径("rc:发光达摩.bmp"))
    return 判断找图结果()
结束

功能 寻找打开的达摩()
    log("寻找领取达摩")
    lw.findpic(415,367,423,378, 获取资源路径("rc:打开的达摩.bmp"))
    return 判断找图结果()
结束

功能 寻找组队界面()
    log("寻找组队界面")
    lw.findpic(37,71,74,120, 获取资源路径("rc:组队界面的小铃铛.bmp"))
    return 判断找图结果()
结束

功能 寻找开始战斗()
    log("寻找开始战斗")
    lw.findpic(690,437,732,464, 获取资源路径("rc:开始战斗.bmp"))
    return 判断找图结果()
结束

功能 寻找离开组队()
    log("找离开组队")
    lw.findpic(178,443,192,454, 获取资源路径("rc:离开队伍.bmp"))
    return 判断找图结果()
结束

功能 判断找图结果()
    if(lw.GetX() !=-1 && lw.GetY() != -1)
        log("x->"& lw.GetX() & " y->" & lw.GetY())
        return 真
    else
        log("找图失败")
        return 假
    end
结束